app/views/incomes/edit.html.erb

    <%#= select_tag "category", options_from_collection_for_select(@category, 'name','name', @income.category.name)%>
    <%= fact.collection_select "name", Category.all, :name, :name  %>
---
SELECT `categories`.* FROM `categories`