app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Salary', '2017-07-05 03:10:38', '2017-07-05 03:10:38')

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE `categories` SET `name` = 'Freelance', `updated_at` = '2017-07-05 03:11:12' WHERE `categories`.`id` = 2

  def destroy
    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 3