app/controllers/expenditures_controller.rb

  def index
    @expenditures = Expenditure.includes(:category).where(:user_id=>current_user.id)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3
SELECT `expenditures`.* FROM `expenditures` WHERE `expenditures`.`user_id` = 1

  def create
    @expenditure = Expenditure.new(expenditure_params)

    respond_to do |format|
      if @expenditure.save
---
INSERT INTO `expenditures` (`amount`, `user_id`, `created_at`, `updated_at`) VALUES (200, 1, '2017-07-05 10:42:42', '2017-07-05 10:42:42')

    def set_expenditure
      @expenditure = Expenditure.find_by(:id => params[:id], :user_id => current_user.id)
      raise ActiveRecord::RecordNotFound if @expenditure.blank?
---
SELECT  `expenditures`.* FROM `expenditures` WHERE `expenditures`.`id` = 3 AND `expenditures`.`user_id` = 2 LIMIT 1
SELECT `expenditures`.* FROM `expenditures`