app/controllers/incomes_controller.rb

  def index
    @incomes = Income.includes(:category).where(:user_id=>current_user.id)
---
SELECT  `incomes`.* FROM `incomes` WHERE `incomes`.`user_id` = 1 ORDER BY `incomes`.`id` ASC LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (4, 1)

  def create
    @income = Income.new(income_params)

    respond_to do |format|
      if @income.save
---
INSERT INTO `incomes` (`amount`, `user_id`, `created_at`, `updated_at`) VALUES (1212, 1, '2017-07-05 08:02:10', '2017-07-05 08:02:10')

  def update
    respond_to do |format|
      if @income.update(income_params)
---
UPDATE `incomes` SET `user_id` = 1, `updated_at` = '2017-07-05 08:02:25' WHERE `incomes`.`id` = 1

    def set_income
      @income = Income.find_by(:id=>params[:id], :user_id => current_user.id)
      raise ActiveRecord::RecordNotFound if @income.blank?
---
SELECT  `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 3 AND `incomes`.`user_id` = 1 LIMIT 1
SELECT `incomes`.* FROM `incomes`